---
kind: method
id: M:Autodesk.Revit.DB.Analysis.AnalysisDisplayColorEntry.IsEqual(Autodesk.Revit.DB.Analysis.AnalysisDisplayColorEntry)
source: html/2837c504-92f3-fe22-2df4-354de27a00b4.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayColorEntry.IsEqual Method

Compare color entries.

## Syntax (C#)
```csharp
public bool IsEqual(
	AnalysisDisplayColorEntry other
)
```

## Parameters
- **other** (`Autodesk.Revit.DB.Analysis.AnalysisDisplayColorEntry`) - Color entry to compare to.

## Returns
True if color entries are equal, false otherwise.